
```
Terraform will perform the following actions:

  # aws_elasticache_replication_group.main will be created
  + resource "aws_elasticache_replication_group" "main" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = false
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "6.x"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "mon:13:00-mon:14:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t2.micro"
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "default.redis6.x"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replication_group_description  = "Amazon ElastiCache Redis for christchurches-map-ecs"
      + replication_group_id           = "christchurches-map-ecs-redis"
      + security_group_ids             = [
          + "sg-031ed8836c6d18abb",
        ]
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 1
      + snapshot_window                = "19:00-20:00"
      + subnet_group_name              = "christchurches-map-ecs-subnet-group"
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = false

      + cluster_mode {
          + num_node_groups         = 1
          + replicas_per_node_group = 2
        }
    }
```